[
  {
    "name": "Recycling Dispenser",
    "image": "garbage-2.jpeg",
    "description": "The highlights of this project were visiting the Wynn Hotel, going to the pool at the Mirage Hotel, and eating all around the city!",
    "content": [
      {
        "type": "image",
        "src": "garbage-2.jpeg",
        "title": "Modelling of parts in CAD software",
        "description": "This is an image of the side view of the recycling dispenser in Autodesk Inventor. Each and every piece was designed to fit each other perfectly. Once everything was made, we assembled all the parts in one file, and added movement constraints so that it would simulate real mechanical movements."
      },
      {
        "type": "image",
        "src": "garbage-1.jpeg",
        "title": "Assembly of parts",
        "description": "Once we were sure that all the parts would work together accordingly, we 3D printed each and every one. Me, as well as my team, assembled all the parts together using screws. Our mechanism ended up working out in the end, only needing slight changes so that it could work more effectively."
      },
      {
        "type": "video",
        "src": "garbage-3.mov",
        "title": "Robot movement in action"
      }
    ]
  },
  {
    "name": "Ultrasonic Cane",
    "image": "cane-4.jpeg",
    "description": "Me and my team of brilliant engineers designed a can that would detect objects above it so that people who are blind don't run into objects that are overhanging.",
    "content": [
      {
        "type": "image",
        "src": "cane-3.jpeg",
        "title": "Prototyping",
        "description": "All of our team members were tasked to made some sort of prototype design. I came up with glasses with sensors and a sound system. Although we did not follow through with this, we used some of the aspects such as sensor technology to encorporate into our final design."
      },
      {
        "type": "image",
        "src": "cane-1.jpeg",
        "title": "Ultrasonic Sensor",
        "description": "This sensor has cone-like perimeter that can detect anything it is looking at. It is so precise, that it can even detect objects as thin as a piece of rope."
      },
      {
        "type": "image",
        "src": "cane-2.jpeg",
        "title": "Vibrating Handle",
        "description": "The handle is a custom designed and made out of silicon and red food coloring. It has an ergonomic grip, and vibrates whenever the sensor detects an object. It also has an on/of switch that is easily accessible using your thumb."
      },
      {
        "type": "youtube",
        "src": "https://www.youtube.com/embed/Xn_OXclwqPI?si=7E6IsrEXpHopkxGd",
        "title": "Demonstration video",
        "description": "In this video, we demonstrate exactly how our device functions in some rough situations. One of our group members is even closing his eyes, while also walking through tight corners."
      }
    ]
  }
]
